app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "TestArticle"], ["text", "Test Test Test"], ["created_at", 2016-08-16 18:44:34 UTC], ["updated_at", 2016-08-16 18:44:34 UTC]]
---
	def create
  		@article = Article.new(article_params)

  		if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Testtest"], ["text", "test test test"], ["updated_at", 2016-08-03 16:23:06 UTC], ["id", 1]]
---
	def update
 		@article = Article.find(params[:id])
    authorize @article
		if @article.update(article_params)